{
  "projects": [
{
  "title": "CodeCell Live",
    "description": "Real-time collaborative IDE that executes code inside isolated Firecracker microVMs orchestrated by a Go backend. React/TypeScript + Monaco UI with live presence; tRPC API and WebSocket streaming. Fast snapshot boot, per-session filesystem, and resource quotas for safety; currently Python-only, with multi-language support on the roadmap.",
  "date": "Summer 2025 – Present",
  "languages": ["TypeScript", "React", "Go", "Firecracker", "tRPC", "WebSocket", "Monaco Editor"],
  "cover": "codecellCover.png",
  "images": ["codecell1.png"],
  "link": ["https://github.com/stanleyavril123/codecell-live", "Github Repo"]
},
    {
      "title": "Recon tool",
      "description": "Designed a local web recon pipeline (React/Express/Flask, Nmap, Playwright) that discovers open services and pages, streams real-time progress, and outputs structured JSON for analysis. Shipped with team of three; emphasized safe, authorized-only scanning and a smooth developer UX.",
      "date": "Fall 2024 - Winter 2025",
      "languages": [
        "JavaScript",
        "TSX",
        "Python",
        "Node.js",
        "Express.js",
        "Flask API"
      ],
      "cover": "reconCover.png",
      "images": ["recontool1.png", "recontool2.png"],
      "link": ["https://github.com/stanleyavril123/sectool", "Github Repo"]
    },
    {
      "title": "Porfolio Website",
      "description": "A modern and responsive portfolio website built with React and Material-UI. This project is designed to present my professional experience, skills, and projects in a smooth, user-friendly, and visually appealing manner. It provides a seamless experience for visitors to explore my journey and contact me effortlessly.",
      "date": "Winter 2024",
      "languages": ["React", "Javascript", "MUI"],
      "cover": "portfolioCover.png",
      "images": ["portfolio1.png", "portfolioCover.png", "portfolio2.png"],
      "link": ["https://github.com/stanleyavril123/myPortfolio", "Github Repo"]
    },
    {
      "title": "Polyscope",
      "description": "Contributed to enhancing the official university newspaper website, Le Polyscope, by designing and implementing new features using React and Firebase. Collaborated with a team to improve the user experience through responsive interfaces built with Material-UI. Gained hands-on experience in Agile development, sprint planning, and GitLab version control.",
      "date": "Summer 2024",
      "languages": ["React", "Javascript", "Firebase", "GitLab"],
      "cover": "polyscopeCover.png",
      "images": ["polyscope1.png", "polyscope2.png", "polyscope3.png"],
      "link": ["https://www.polyscope.qc.ca/", "Le Polyscope"]
    }
  ],

"about": {
  "about_me": [
    "I’m a software engineering student at Polytechnique Montréal who loves building useful, user-friendly products. I care about clear, simple experiences that solve real problems and feel great to use.",
    "Recently I’ve been creating two projects I’m proud of : a collaborative coding app where people can write and see results in real time, and a recon automation tool that speeds up the first stage of pentesting by scanning sites, crawling their pages, and surfacing hidden directories for review.",
    "Last summer I completed a startup accelerator for a cybersecurity project. That experience sharpened how I scope ideas, ship quickly, and collaborate building a strong foundation in software design, problem-solving, and teamwork.",
    "Beyond coding, I’m an avid Brazilian jiu-jitsu practitioner, a fitness enthusiast, and a runner. Those routines help me stay disciplined, keep a clear head, and keep exploring creative hobbies while planning my next big idea."
  ]
}



}
